In [3]:
import pandas as pd

data = pd.read_csv('illiteracy.txt', sep='\t')

In [4]:
data

      Country  Illit  Births
0     Albania   20.5    1.78
1     Algeria   39.1    2.44
2     Bahrain   15.0    2.34
3      Belize    5.9    2.97
4       Benin   73.5    5.60
..        ...    ...     ...
89  Venezuela    6.9    2.65
90    Vietnam    8.5    1.78
91      Yemen   69.8    5.87
92     Zambia   25.2    5.40
93   Zimbabwe   12.9    3.34

[94 rows x 3 columns]

In [7]:
data.corr(method = 'pearson')

           Illit    Births
Illit   1.000000  0.768663
Births  0.768663  1.000000

In [8]:
round(0.768663, 4)

0.7687

In [9]:
data.corr(method = 'spearman')

           Illit    Births
Illit   1.000000  0.752962
Births  0.752962  1.000000

In [10]:
round(0.752962, 4)

0.753